InformationRegisters/ЛБ_КонтактнаяИнформацияЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КонтактнаяИнформацияЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПрописке</Name>
					<Comment>Адрес по прописке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Comment>Фактический адрес</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Comment>Адрес для почтовой рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Comment>Телефон дополнительный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительныйСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Comment>E-mail</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛицаСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформацииДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОснованияИзмененияФИО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяАдресПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияАдресаПоПрописке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФактическогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияПочтовогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЛомбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДокументовЗалогодателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийПравоПребыванияРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ПоискЗалогодателяРедактирование/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФамилияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 2 Тогда
		ФИО = Текст;
        НайтиВозможныеВариантыЗалогодатели();
	ИначеЕсли СтрДлина(Текст) = 0 Тогда	 
		ФИО = Текст;
		Залогодатели.Очистить();	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФИООчистка(Элемент, СтандартнаяОбработка)
	Фио = "";
	НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеВыбораЗалогодателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	Если Параметры.Свойство("Гражданство") Тогда
		Гражданство = Параметры.Гражданство;
	Иначе
		Гражданство = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	КонецЕсли;
    ФИО = СокрЛП(Результат.Залогодатель);
	НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗалогодателя(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", , ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура НайтиВозможныеВариантыЗалогодатели()
	Если НЕ ПустаяСтрока(ФИО) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Залогодатели.Ссылка КАК Залогодатель,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения
		               |ИЗ
		               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
		               |ГДЕ
		               |	ЛБ_Залогодатели.Наименование ПОДОБНО &Фио
		               |	И НЕ ЛБ_Залогодатели.ПометкаУдаления";

		//Запрос.УстановитьПараметр("Фио", "%"+Фио+"%");
		Запрос.УстановитьПараметр("Фио", Фио+"%");
		Залогодатели.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		Залогодатели.Очистить();
	КонецЕсли;	
	Если ЗначениеЗаполнено(Гражданство) ИЛИ (СтрДлина(Серия)>3) ИЛИ (СтрДлина(Номер)>3) Тогда
        НайтиВозможныеВариантыДокументы();
	КонецЕсли;	   
КонецПроцедуры

&НаСервере
Процедура НайтиВозможныеВариантыДокументы()
	Если ЗначениеЗаполнено(Гражданство) ИЛИ (СтрДлина(Серия)>3) ИЛИ (СтрДлина(Номер)>3) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя.Владелец КАК Залогодатель
		               |ИЗ
		               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		               |			,
		               |			ДокументНеДействителен = ЛОЖЬ
		               |				И ВидДокументаЗалогодателя = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)
		               |				И (ДокументСерия ПОДОБНО &Серия
		               |					ИЛИ &Серия = """")
		               |				И (ДокументНомер ПОДОБНО &Номер
		               |					ИЛИ &Номер = """")";
		Если ЗначениеЗаполнено(Гражданство) Тогда
			Запрос.Текст = Запрос.Текст + "
		               |				И Гражданство = &Гражданство";
		КонецЕсли;
		Если НЕ Залогодатели.Количество() = 0 Тогда
			Запрос.Текст = Запрос.Текст + "
		               |				И ДокументЗалогодателя.Владелец В (&Залогодатели)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + ") КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
		Запрос.УстановитьПараметр("Серия", СокрЛП(Серия)+"%");
		Запрос.УстановитьПараметр("Номер", СокрЛП(Номер)+"%");
		Запрос.УстановитьПараметр("Гражданство", Гражданство);
		СписокЗ = Новый СписокЗначений;
		Для каждого Стр Из Залогодатели Цикл
			СписокЗ.Добавить(Стр.Залогодатель);
		КонецЦикла;
		Запрос.УстановитьПараметр("Залогодатели", СписокЗ);
			
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаЗапроса.Количество() > 0 Тогда
		    Запрос.Текст = "ВЫБРАТЬ
		                   |	ЛБ_Залогодатели.Ссылка КАК Залогодатель,
		                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона,
		                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
		                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаСмерти КАК ДатаСмерти,
		                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения
		                   |ИЗ
		                   |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
		                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		                   |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
		                   |ГДЕ
		                   |	ЛБ_Залогодатели.Ссылка В(&Залогодатели)";
			Запрос.УстановитьПараметр("Залогодатели", ТаблицаЗапроса.ВыгрузитьКолонку("Залогодатель"));

			Залогодатели.Загрузить(Запрос.Выполнить().Выгрузить());
		Иначе
			Залогодатели.Очистить();
		КонецЕсли;
	ИначеЕсли НЕ ПустаяСтрока(Фио) И СтрДлина(ФИО) > 2 Тогда
		НайтиВозможныеВариантыЗалогодатели();
	Иначе
		Залогодатели.Очистить();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ФамилияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 2 Тогда
		ФИО = Текст;
        НайтиВозможныеВариантыЗалогодатели();  
	ИначеЕсли СтрДлина(Текст) = 0 Тогда	 
		ФИО = Текст;
		Залогодатели.Очистить();	
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НомерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если СтрДлина(Текст) >= 4 Тогда
		Номер = Текст;
        НайтиВозможныеВариантыЗалогодатели();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияЗалогодателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
	ТекущаяСтрока.Залогодатель = Результат.Залогодатель;
	ТекущаяСтрока.НомерТелефона = Результат.НомерТелефона;
	ТекущаяСтрока.ДатаРождения = Результат.ДатаРождения;	
КонецПроцедуры


&НаСервере
Функция ПолучитьОсновнойДУЛ(Залогодатель)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей КАК ЛБ_ДокументыЗалогодателей
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателей.ДокументЗалогодателя.Владелец = &Владелец	         
	               |	И ЛБ_ДокументыЗалогодателей.ОсновнойДУЛ = ИСТИНА";
	Если ЗначениеЗаполнено(Гражданство) Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И ЛБ_ДокументыЗалогодателей.Гражданство = &Гражданство";
	КонецЕсли;
	Запрос.УстановитьПараметр("Владелец", Залогодатель);
	Запрос.УстановитьПараметр("Гражданство", Гражданство);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументЗалогодателя;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

&НаКлиенте
Процедура ПослеРедактированияКлиента(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда		
        Возврат;
	КонецЕсли;    	
    ТекСтрока = Элементы.Залогодатели.ТекущиеДанные;
	ТекСтрока.Залогодатель = Результат.Залогодатель;
	ТекСтрока.ДатаРождения = Результат.ДатаРождения;
	ТекСтрока.НомерТелефона = Результат.НомерТелефона;
	ЭтаФорма.ОтобразитьИзменениеДанных(ТекСтрока.Залогодатель, ВидИзмененияДанных.Изменение); 
	НайтиВозможныеВариантыЗалогодатели();    
	Отбор = Новый Структура;
	Отбор.Вставить("Залогодатель", Результат.Залогодатель);
	Строки = Залогодатели.НайтиСтроки(Отбор);  
	Если НЕ Строки.Количество() = 0 Тогда 
		Стр = Строки[0];
	    Элементы.Залогодатели.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.Залогодатели.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = неопределено Тогда
		СписокВыбора = Новый СписокЗначений; 

		СписокВыбора.Добавить("Просмотр", "Просмотр карточки залогодателя"); 
		СписокВыбора.Добавить("История", "Отчет по истории изменений карточки залогодателя");
		//+МАН 23.04.25 Убрал возможность создания выдачи. Заявка 2956
		//СписокВыбора.Добавить("Залог", "Оформить операцию по залогу");
		//-МАН

		ВыбранноеЗначение = ВыбратьИзМеню(СписокВыбора, Элементы.Залогодатели.ТекущаяСтрока); 
        Если НЕ ВыбранноеЗначение = неопределено Тогда
			Если ВыбранноеЗначение.Значение = "Просмотр" Тогда 
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
				ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
				Оповещение = Новый ОписаниеОповещения("ПослеРедактированияКлиента",ЭтаФорма);
				ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
			ИначеЕсли ВыбранноеЗначение.Значение = "История" Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
				ОткрытьФорму("Отчет.ЛБ_ОтчетИсторияИзмененияЗалогодателя.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
				
			ИначеЕсли ВыбранноеЗначение.Значение = "Залог" Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Залогодатель", ТекущаяСтрока.Залогодатель);
				ДокументЗалогодателя = ПолучитьОсновнойДУЛ(ТекущаяСтрока.Залогодатель);
				Если НЕ ДокументЗалогодателя = неопределено Тогда
				    ПараметрыФормы.Вставить("ДокументЗалогодателя", ДокументЗалогодателя);
				КонецЕсли;	
				ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог"));
				ОткрытьФорму("Документ.ЛБ_ОперацияПоЗалогу.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоПриИзменении(Элемент)
	НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоОчистка(Элемент, СтандартнаяОбработка)
	НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры

&НаКлиенте
Процедура НомерОчистка(Элемент, СтандартнаяОбработка)
	Номер = "";
	НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры

&НаКлиенте
Процедура СерияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если СтрДлина(Текст) >= 4 Тогда
		Серия = Текст;
        НайтиВозможныеВариантыЗалогодатели();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерияОчистка(Элемент, СтандартнаяОбработка)
	Серия = "";
    НайтиВозможныеВариантыЗалогодатели();
КонецПроцедуры
